RIET/src/DataProcessors/LocalDistributionPlannerDesktop/LocalDistributionPlannerDesktop.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>LocalDistributionPlannerDesktop</name>
</mdclass:DataProcessor>

RIET/src/Catalogs/Parcels/Parcels.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Parcels</name>
  <attributes>
    <name>DONo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExportRequest</name>
    <type>
      <types>DocumentRef.ExportRequest</types>
    </type>
  </attributes>
  <attributes>
    <name>TransportRequest</name>
    <type>
      <types>DocumentRef.TransportRequest</types>
    </type>
  </attributes>
  <attributes>
    <name>PackingType</name>
    <type>
      <types>CatalogRef.PackingTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬPackingType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SerialNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Length</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Width</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Height</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DIMsUOM</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>LengthCM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WidthCM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HeightCM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CubicMeters</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GrossWeight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NetWeight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WeightUOM</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossWeightKG</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NetWeightKG</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VolumeWeight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ChargeableWeight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LocalOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>POList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseFrom</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseTo</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Urgency</name>
    <type>
      <types>EnumRef.Urgencies</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Repacked</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HazardClass</name>
    <type>
      <types>CatalogRef.HazardClasses</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionOfItems</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SpecialHandling</name>
    <type>
      <types>CatalogRef.SpecialHandling</types>
    </type>
  </attributes>
  <attributes>
    <name>NumOfParcels</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RDD</name>
    <comment>Required delivery date</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeliveredToWH</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LocalImpacked</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SpecialInstructions</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>SuppliersList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LengthCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WidthCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HeightCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CubicMetersCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GrossWeightCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LengthCMCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WidthCMCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HeightCMCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GrossWeightKGCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Детали</name>
    <attributes>
      <name>СтрокаИнвойса</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявкиНаЗакупку</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаЗаявкиНаЗакупку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Receiver</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Qty</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QtyUOM</name>
      <type>
        <types>CatalogRef.UOMs</types>
      </type>
    </attributes>
    <attributes>
      <name>NetWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GrossWeightKG</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ChargeableWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/Transport/Transport.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Transport</name>
  <predefined>
    <items>
      <name>CallOut</name>
      <description>Call-out transport</description>
    </items>
  </predefined>
  <attributes>
    <name>ServiceProvider</name>
    <type>
      <types>CatalogRef.ServiceProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>Equipment</name>
    <type>
      <types>CatalogRef.Equipments</types>
    </type>
  </attributes>
  <attributes>
    <name>Brand</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MonitoringSystem</name>
    <type>
      <types>CatalogRef.MonitoringSystems</types>
    </type>
  </attributes>
  <attributes>
    <name>TypeOfTransport</name>
    <type>
      <types>EnumRef.TypesOfTransport</types>
    </type>
  </attributes>
  <attributes>
    <name>Site</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Model</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Tonnage</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SemitrailerPN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьMonthlyRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SemitrailerBrand</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SemitrailerModel</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Geomarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ParametersOfMonitoring</name>
    <attributes>
      <name>ParameterIdentifier</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SynonymOfParameter</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ParameterValue</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AddedManually</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>MandatoryField</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/DataProcessors/LocalDistributionPlannerDesktop/Forms/Форма/Module.bsl
&НаКлиенте
Процедура TripDateПриИзменении(Элемент)
	
	TripDay = НачалоДня(TripDate);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрNewTripTRs();
	
	ТекДата = КонецДня(ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	
КонецПроцедуры

// Planning Trip

&НаКлиенте
Процедура GenerateDraftTrip(Команда)

	Если Не ЗначениеЗаполнено(TripDate) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Select Departure date!", , "TripDate");
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(NewTripTransport) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Select Transport!", , "NewTripTransport");
		Возврат;
	КонецЕсли;   
	
	Если Не ЗначениеЗаполнено(Equipment) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Select Equipment!", , "Equipment");
		Возврат;
	КонецЕсли;
	
	Если NewTrip.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Select Transport request!", , "NewTrip");
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура("TransportRequests,Transport,Equipment,TripDate", 
		РГСофтКлиентСервер.ВыгрузитьКолонкуКоллекцииБезПустыхЗначенийИДублей(NewTrip, "TransportRequest"), NewTripTransport, Equipment, TripDate);
	
	Если ЗначениеЗаполнено(DraftTrip) Тогда 
		ПерезаполнитьDraftTripНаСервере(СтруктураЗаполнения);
		СтруктураПараметров = Новый Структура("Ключ", DraftTrip);
	иначе
		СтруктураПараметров = Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения); 	
	КонецЕсли;
	
	ОткрытьФорму("Документ.TripNonLawsonCompanies.ФормаОбъекта", СтруктураПараметров, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	DeletePlanНаКлиенте();

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьDraftTripНаСервере(СтруктураЗаполнения)
	
	DraftTripОбъект = DraftTrip.ПолучитьОбъект();
	DraftTripОбъект.Заполнить(СтруктураЗаполнения);
	DraftTripОбъект.Записать();	
	
КонецПроцедуры

&НаКлиенте
Процедура DeletePlan(Команда)
	
	DeletePlanНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура DeletePlanНаКлиенте()
	
	NewTrip.Очистить();
	TripDate = Неопределено;
	Equipment = Неопределено;
	DraftTrip = Неопределено;
	NewTripTransport = Неопределено;
	EffectiveWeight = Неопределено;
	Элементы.Transport.Обновить();
	УстановитьПараметрNewTripTRs();
	ПересчитатьNewTripTotal();
	
КонецПроцедуры

&НаКлиенте
Процедура NewTripВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.NewTrip.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		ПоказатьЗначение(,ТекущиеДанные.TransportRequest);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура NewTripПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Transport requests

&НаКлиенте
Процедура AddToTrip(Команда)
	
	AddToTripНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура AddToTripНаКлиенте()
	
	МассивTR = Элементы.TransportRequests.ВыделенныеСтроки;
	Если МассивTR.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Select Transport request!", , "TransportRequests");
		Возврат;
	КонецЕсли;
	
	ДобавитьTransportRequestsВTrip(МассивTR);
	
	ПересчитатьNewTripTotal();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьTransportRequestsВTrip(МассивTR) 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивTR", МассивTR);

	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументTransportRequest.Ссылка КАК TransportRequest,
	               |	СУММА(Parcels.GrossWeightKG) КАК GrossWeightKG,
	               |	СУММА(Parcels.NumOfParcels) КАК NumOfParcels,
	               |	СУММА(Parcels.CubicMeters) КАК CubicMeters
	               |ИЗ
	               |	Документ.TransportRequest КАК ДокументTransportRequest
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Parcels КАК Parcels
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.TripNonLawsonCompanies.Parcels КАК TripNonLawsonCompaniesParcels
	               |			ПО (НЕ TripNonLawsonCompaniesParcels.Ссылка.ПометкаУдаления)
	               |				И Parcels.Ссылка = TripNonLawsonCompaniesParcels.Parcel
	               |		ПО ДокументTransportRequest.Ссылка = Parcels.TransportRequest
	               |			И (НЕ Parcels.ПометкаУдаления)
	               |ГДЕ
	               |	ДокументTransportRequest.Проведен
	               |	И ДокументTransportRequest.Ссылка В (&МассивTR)
	               |	И TripNonLawsonCompaniesParcels.Ссылка ЕСТЬ NULL 
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДокументTransportRequest.Ссылка";
	  		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = NewTrip.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
	УстановитьПараметрNewTripTRs();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрNewTripTRs() 
	
	TransportRequests.Параметры.УстановитьЗначениеПараметра("NewTripTRs", 
		РГСофтКлиентСервер.ВыгрузитьКолонкуКоллекцииБезПустыхЗначенийИДублей(NewTrip, "TransportRequest"));
		
	TransportRequests.Параметры.УстановитьЗначениеПараметра("DraftTrip", DraftTrip);
	
КонецПроцедуры

&НаКлиенте
Процедура DeleteFromTrip(Команда)
	
	DeleteFromTripНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура NewTripОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	DeleteFromTripНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура DeleteFromTripНаКлиенте()
	
	МассивTR = Элементы.NewTrip.ВыделенныеСтроки;
	Если МассивTR.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Select Transport request!", , "NewTrip");
		Возврат;
	КонецЕсли;
	
	Для Каждого Стр из Элементы.NewTrip.ВыделенныеСтроки Цикл
		ВыделеннаяСтрока = NewTrip.НайтиПоИдентификатору(Стр);
		NewTrip.Удалить(ВыделеннаяСтрока);
	КонецЦикла; 
	
	УстановитьПараметрNewTripTRs();
	ПересчитатьNewTripTotal();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьNewTripTotal()
	
	TotalGrossWeightKG = NewTrip.Итог("GrossWeightKG");
	TotalCubicMeters = NewTrip.Итог("CubicMeters");
	TotalNumOfParcels = NewTrip.Итог("NumOfParcels");
	
	Если EffectiveWeight = 0 Тогда 
		Difference = 0;
		LoadingPercent = 0;
	иначе  	
		Difference = EffectiveWeight - TotalGrossWeightKG;
		LoadingPercent = (TotalGrossWeightKG / EffectiveWeight) * 100;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура TransportRequestsВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	AddToTripНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура TransportRequestsОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	AddToTripНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура TransportRequestsПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


// Transport

&НаКлиенте
Процедура TransportВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	NewTripTransport = Значение;
	
	ЗаполнитьEquipment();
	
КонецПроцедуры

// Draft trips

&НаКлиенте
Процедура DraftTripsВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	DraftTrip = Значение;
	
	Если NewTrip.Количество() > 0 Тогда 
		//
	КонецЕсли;
	
	ЗаполнитьТЗNewTripНаСервере(DraftTrip);
	
	УстановитьПараметрNewTripTRs();

	ЗаполнитьEquipment();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЗNewTripНаСервере(DraftTrip)
	
	NewTrip.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("DraftTrip", DraftTrip);
	Запрос.Текст = "ВЫБРАТЬ
	               |	TripNonLawsonCompaniesParcels.Parcel.TransportRequest КАК TransportRequest,
	               |	СУММА(TripNonLawsonCompaniesParcels.NumOfParcels) КАК NumOfParcels,
	               |	СУММА(TripNonLawsonCompaniesParcels.Parcel.GrossWeightKG) КАК GrossWeightKG,
	               |	СУММА(TripNonLawsonCompaniesParcels.Parcel.CubicMeters) КАК CubicMeters,
	               |	TripNonLawsonCompaniesParcels.Ссылка.Transport,
	               |	TripNonLawsonCompaniesParcels.Ссылка.Дата,
	               |	TripNonLawsonCompaniesParcels.Ссылка.Equipment
	               |ИЗ
	               |	Документ.TripNonLawsonCompanies.Parcels КАК TripNonLawsonCompaniesParcels
	               |ГДЕ
	               |	TripNonLawsonCompaniesParcels.Ссылка = &DraftTrip
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	TripNonLawsonCompaniesParcels.Parcel.TransportRequest,
	               |	TripNonLawsonCompaniesParcels.Ссылка.Transport,
	               |	TripNonLawsonCompaniesParcels.Ссылка.Дата,
	               |	TripNonLawsonCompaniesParcels.Ссылка.Equipment";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		НоваяСтрока = NewTrip.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
	КонецЦикла;
	
	NewTripTransport = Выборка.Transport;
	TripDate = Выборка.Дата;
	Equipment = Выборка.Equipment;
			
КонецПроцедуры

&НаКлиенте
Процедура NewTripTransportПриИзменении(Элемент)
	
	ЗаполнитьEquipment();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьEquipment()
	 	
	Элементы.Equipment.ТолькоПросмотр = (NewTripTransport <> ПредопределенноеЗначение("Справочник.Transport.CallOut"));
	
	Equipment = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(NewTripTransport, "Equipment");
	                       	
	ПриИзмененииEquipment();
	
	ПересчитатьNewTripTotal();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииEquipment()
	
	EffectiveWeight = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Equipment, "EffectiveWeight");
	
КонецПроцедуры

&НаКлиенте
Процедура EquipmentПриИзменении(Элемент)
	
	ПриИзмененииEquipment();
	
КонецПроцедуры
